import { Post } from "@/utils/type/feed";

export const seedPosts: Post[] = [
  {
    id: 1,
    title:
      "이거 다 알면 드라마 중독 ㅇㅇ 드라마 밈 TOP10 #shorts #밈 #트렌드 #호박고구마",
    content:
      "이거 다 알면 드라마 중독임 ㅋㅋㅋㅋㅋ\nㄴ(삐삑 검거 완)\n\n-\n\n자세한 내용이 궁금하다면?\n프로필 링크 속 브랜더쿠 홈페이지를 확인하세요! 👆",
    media_url: "https://www.youtube.com/watch?v=j0cpk88cY58",
    media_upload_time: "2025-05-20T16:58:59Z",
    account_id: 1,
    category_id: 1,
    created_at: "2025-05-20T17:39:10.251Z",
    updated_at: "2025-05-20T17:39:10.251Z",
    deleted_at: null,
    is_deleted: false,
  },
  {
    id: 2,
    title:
      "(개정판) K MEME의 역사 | 2005-2022 추억의 유행어, 짤방, 밈 복습하기",
    content:
      "#밈 #유행어 #추억 #2010년대 #2000년대 #짤방\n\n00:00 2005년\n01:19 2006년\n02:29 2007년\n04:07 2008년\n06:19 2009년\n08:21 2010년\n09:30 2011년\n10:57 2012년\n12:52 2013년\n15:31 2014년\n17:45 2015년\n19:37 2016년\n21:00 2017년\n21:55 2018년\n22:48 2019년\n24:05 2020년\n25:35 2021년\n27:15 2022년",
    media_url: "https://www.youtube.com/watch?v=thpZloYjF8k",
    media_upload_time: "2025-05-20T16:59:08Z",
    account_id: 1,
    category_id: 1,
    created_at: "2025-05-20T17:39:10.251Z",
    updated_at: "2025-05-20T17:39:10.251Z",
    deleted_at: null,
    is_deleted: false,
  },
  {
    id: 3,
    title: "이병헌의 본인 밈 활용법 #snl",
    content: "#snl #snl코리아 #하이라이트 #레전드 #명장면 #shorts",
    media_url: "https://www.youtube.com/watch?v=3x0ZQJ4UDA0",
    media_upload_time: "2025-05-20T16:59:11Z",
    account_id: 1,
    category_id: 1,
    created_at: "2025-05-20T17:39:10.251Z",
    updated_at: "2025-05-20T17:39:10.251Z",
    deleted_at: null,
    is_deleted: false,
  },
  {
    id: 4,
    title:
      "2023 밈/유행어 Quiz (#신서유기 #지구오락실 #MT게임 #야유회 #술자리게임#밈 #meme )",
    content:
      "2023 밈/유행어 Quiz\n\n올한해 마무리를 밈과 유행어로 알아보세요!\n (#신서유기 #지구오락실 #MT게임 #야유회 #술자리게임)",
    media_url: "https://www.youtube.com/watch?v=AU8pD8aJiBM",
    media_upload_time: "2025-05-20T16:59:19Z",
    account_id: 1,
    category_id: 1,
    created_at: "2025-05-20T17:39:10.251Z",
    updated_at: "2025-05-20T17:39:10.251Z",
    deleted_at: null,
    is_deleted: false,
  },
  {
    id: 5,
    title:
      "[#또보장] 😂웃음 참기 챌린지💦 스브스 드라마 밈(meme) 총 정리 #드라마밈",
    content:
      "스브스 드라마 속 밈(meme) 모아보기👀\n\n0:00 전설의 익룡짤 #웃어요엄마\n0:30 그거 아세요? 조인성씨... 입에 주먹 넣은 적 없다는 사실😂 #발리에서생긴일\n01:47 강쥐 둥절🐶 #신기생뎐\n02:03 레이저 빔 #신기생뎐\n04:23 공포의 회전목마 #천국의계단\n04:50 사랑은 돌아오는 거야 #천국의계단\n05:18 뚝심있는 두한의 사달라💸 #야인시대\n07:11내가 고자라니....!!! #야인시대\n09:15 스토리는 내가 짤게, 글씨는 누가 쓸래? #순풍산부인과\n10:30 분노의 양치질🔥 #홍콩익스프레스\n10:44 집 나가면 개고생 #아내의유혹\n11:18 병맛 CG #아내의유혹\n\n\nCopyright Ⓒ SBS. All rights reserved. 무단 전재, 재배포 및 AI학습 이용 금지",
    media_url: "https://www.youtube.com/watch?v=LNnr8kz4oLw",
    media_upload_time: "2025-05-20T16:59:24Z",
    account_id: 1,
    category_id: 1,
    created_at: "2025-05-20T17:39:10.251Z",
    updated_at: "2025-05-20T17:39:10.251Z",
    deleted_at: null,
    is_deleted: false,
  },
  {
    id: 6,
    title: "[K-Meme] 한국 드라마/영화 각종 밈 모음 50",
    content:
      "한국의 영화와 드라마에 등장한 각종 밈 50가지를 모아봤습니다.\n명장면들이죠.\n저번에 올렸던 영상에서 짤렸던 부분과 새로운 밈을 추가하였습니다.\n구독과 좋아요 부탁드립니다!",
    media_url: "https://www.youtube.com/watch?v=katZLF",
    media_upload_time: "2025-05-20T16:59:24Z",
    account_id: 1,
    category_id: 1,
    created_at: "2025-05-20T17:39:10.251Z",
    updated_at: "2025-05-20T17:39:10.251Z",
    deleted_at: null,
    is_deleted: false,
  },
];
